In [1]:
import pandas as pd

In [2]:
info = {
    "Name": ["Rahul", "Harshita", "Shradha"],
    "CGPA": [9.5, 7.5, 8.5]
}
df = pd.DataFrame(info)
print(df)

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2   Shradha   8.5

In [3]:
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2   Shradha   8.5

In [4]:
list=pd.Series([1,2,3,4,5])
print(list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
print(list[0])

1

In [7]:
list=pd.Series([1,2,3,4,5],index=(["Vanshika","Vansh","Shruti","Apoorva","Kashish"]))
print(list)

Vanshika    1
Vansh       2
Shruti      3
Apoorva     4
Kashish     5
dtype: int64

In [8]:
list1=pd.Series([1,2,3,4,5])
list2=pd.Series([1,2,3,4,5])
print(list1+list2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [9]:
info = {
    "Name": ["Rahul", "Harshita", "Shradha"],
    "Age":[24,23,26],
    "CGPA": [9.5, 7.5, 8.5]
}
df = pd.DataFrame(info)
print(df)

       Name  Age  CGPA
0     Rahul   24   9.5
1  Harshita   23   7.5
2   Shradha   26   8.5

In [12]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [16]:
data=[
    ["Vanshika", 9.1],
    ["Vansh", 8.5],
    ["Shruti", 8.9],
    ["Apoorva", 9.3],
    ["Kashish", 8.9]
]
df = pd.DataFrame(data, columns=["Name", "CGPA"])
print(df)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.9

In [17]:
df

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.9

In [24]:
import numpy as np
np_array=np.array([[1,3,4],[7,1,5],[2,4,7]])
df = pd.DataFrame(np_array)
print(df)

   0  1  2
0  1  3  4
1  7  1  5
2  2  4  7

In [25]:
df

   0  1  2
0  1  3  4
1  7  1  5
2  2  4  7

In [32]:

data = [
    ["Vanshika", 9.1],
    ["Vansh", 8.5],
    ["Shruti", 8.9],
    ["Apoorva", 9.3],
    ["Kashish", 8.7]
]

dataframe = pd.DataFrame(data, columns=["Name", "CGPA"])


dataframe.to_json("students.json", orient="records", indent=4)
dataframe.to_csv("students.csv", index=False)

In [34]:
dataframe=pd.read_csv("students.csv")
print(dataframe)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [35]:
dataframe=pd.read_json("students.json")
print(dataframe)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [36]:

dataframe.tail(2)

      Name  CGPA
3  Apoorva   9.3
4  Kashish   8.7

In [37]:
dataframe.head(2)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5

In [49]:
dataframe.sample()

     Name  CGPA
2  Shruti   8.9

In [45]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   CGPA    5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 212.0+ bytes

In [51]:
dataframe.shape

(5, 2)

In [52]:
dataframe.describe()

           CGPA
count  5.000000
mean   8.900000
std    0.316228
min    8.500000
25%    8.700000
50%    8.900000
75%    9.100000
max    9.300000

In [53]:
dataframe.columns

Index(['Name', 'CGPA'], dtype='object')

In [54]:
dataframe.nunique()

Name    5
CGPA    5
dtype: int64

In [55]:

df = pd.read_csv("st.csv")
df

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [61]:
df = pd.read_csv("globalAirQuality.csv")
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [62]:
df["country"]

0        US
1        US
2        US
3        US
4        US
         ..
17995    CH
17996    CH
17997    CH
17998    CH
17999    CH
Name: country, Length: 18000, dtype: object

In [63]:
df[["city","aqi"]]

           city  aqi
0      New York  108
1      New York   90
2      New York   84
3      New York  158
4      New York   97
...         ...  ...
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122
17998    Zurich   95
17999    Zurich   88

[18000 rows x 2 columns]

In [67]:
df.loc[0]
df.loc[0:6]

timestamp      2025-11-04 18:25:17.554219
country                                US
city                             New York
latitude                           40.713
longitude                         -74.006
pm25                               50.295
pm10                              108.938
no2                                27.998
so2                                 6.539
o3                                 52.568
co                                  1.096
aqi                                   108
temperature                        18.504
humidity                           70.168
wind_speed                          3.725
Name: 0, dtype: object

In [68]:
df.iloc[0]

timestamp      2025-11-04 18:25:17.554219
country                                US
city                             New York
latitude                           40.713
longitude                         -74.006
pm25                               50.295
pm10                              108.938
no2                                27.998
so2                                 6.539
o3                                 52.568
co                                  1.096
aqi                                   108
temperature                        18.504
humidity                           70.168
wind_speed                          3.725
Name: 0, dtype: object

In [73]:
df.loc[100:110,["city","aqi"]]

         city  aqi
100  New York   89
101  New York   71
102  New York   83
103  New York  126
104  New York   99
105  New York  127
106  New York   98
107  New York  101
108  New York   72
109  New York  112
110  New York  124

In [75]:
df.iloc[100:110,[4,5]]

     longitude    pm25
100    -74.006  42.609
101    -74.006  10.951
102    -74.006  41.645
103    -74.006  22.317
104    -74.006  49.749
105    -74.006  63.994
106    -74.006  44.231
107    -74.006  28.522
108    -74.006  36.495
109    -74.006  51.608

In [78]:
df.at[0,"city"]

'New York'

In [92]:
filter_data=df[(df["aqi"] > 100) & (df["temperature"] <30)]
print(filter_data)

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
8      2025-11-05 02:25:17.554219      US  New York    40.713    -74.006
12     2025-11-05 06:25:17.554219      US  New York    40.713    -74.006
13     2025-11-05 07:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17988  2025-11-19 06:25:17.554219      CH    Zurich    47.377      8.542
17993  2025-11-19 11:25:17.554219      CH    Zurich    47.377      8.542
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
8      60.914   44.775  40.936  6.779  36.751  1.014  121       24.092
12     57.227   28.916  30.698  8.091  63.108  0.967  114       14.584
13     26.147   58.714  49.826  5.228  51.651  0.615  124       27.299
...       ...      ...     ...    ...     ...    ...  ...          ...
17988  61.305   97.044  23.317  6.793  57.102  1.022  122       13.982
17993  76.613   37.495  29.662  5.419  57.042  1.103  153       20.437
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951

       humidity  wind_speed
0        70.168       3.725
3        89.153       8.956
8        48.148       8.686
12       46.654       5.570
13       76.014       0.786
...         ...         ...
17988    30.822       6.769
17993    79.602       2.663
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660

[7337 rows x 15 columns]

In [94]:
filter_data=df[df["aqi"] > 100][["city","aqi"]]
print(filter_data)

           city  aqi
0      New York  108
3      New York  158
6      New York  155
7      New York  115
8      New York  121
...         ...  ...
17991    Zurich  104
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[9721 rows x 2 columns]

In [100]:
filter_data=df[(df["aqi"] > 100) & (df["temperature"] <30)][["city","aqi"]]
print(filter_data)
filter_data.loc[3]
filter_data.iloc[3]

           city  aqi
0      New York  108
3      New York  158
8      New York  121
12     New York  114
13     New York  124
...         ...  ...
17988    Zurich  122
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[7337 rows x 2 columns]

city    New York
aqi          114
Name: 12, dtype: object

In [102]:
filtered_df = df.query("aqi > 100 and temperature < 30")
filtered_df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
8,2025-11-05 02:25:17.554219,US,New York,40.713,-74.006,60.914,44.775,40.936,6.779,36.751,1.014,121,24.092,48.148,8.686
12,2025-11-05 06:25:17.554219,US,New York,40.713,-74.006,57.227,28.916,30.698,8.091,63.108,0.967,114,14.584,46.654,5.570
13,2025-11-05 07:25:17.554219,US,New York,40.713,-74.006,26.147,58.714,49.826,5.228,51.651,0.615,124,27.299,76.014,0.786
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17988,2025-11-19 06:25:17.554219,CH,Zurich,47.377,8.542,61.305,97.044,23.317,6.793,57.102,1.022,122,13.982,30.822,6.769
17993,2025-11-19 11:25:17.554219,CH,Zurich,47.377,8.542,76.613,37.495,29.662,5.419,57.042,1.103,153,20.437,79.602,2.663
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660

In [103]:
filtered_df = df.query("aqi > 100 and temperature < 30")[["city","aqi"]]
filtered_df

           city  aqi
0      New York  108
3      New York  158
8      New York  121
12     New York  114
13     New York  124
...         ...  ...
17988    Zurich  122
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[7337 rows x 2 columns]

In [111]:
df=pd.read_csv("raw_data.csv")
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [108]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [112]:
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [113]:
df.dropna()

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [117]:
df.fillna(0)

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [121]:
age_mean = df["age"].mean()
print(age_mean)
df["age"] = df["age"].fillna(age_mean)
df

32.75

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [125]:
df["age"] = df["age"].ffill()
df

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00   India     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [127]:
df["age"] = df["age"].bfill()
df

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00   India     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [134]:
df2 = df.copy()
df2 = df2.fillna(0)
df2["age"] = df2["age"].astype("int64").copy()

print(df2.dtypes)

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [135]:
df2

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
1    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith   32  Canada   Female  62000.0
3    3          Alex   32     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female      0.0
5    5        Li Wei   27   China     Male  51000.0
6    6             0   45   India   Female  73000.0
7    7    Ahmed Khan   38   India     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz   32  Mexico     Male  45000.0
10  10   Emily Davis   31     USA        0  58000.0

In [136]:
date_str = pd.Series([pd.to_datetime("2026-12-31")])
type(date_str.dtypes)

numpy.dtypes.DateTime64DType

In [137]:
aqi_data = pd.read_csv("globalAirQuality.csv")
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
aqi_data["timestamp"].dtype

dtype('<M8[ns]')

In [2]:
!pip install requests

Requirement already satisfied: requests in c:\users\united\anaconda3\lib\site-packages (2.32.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\united\anaconda3\lib\site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\united\anaconda3\lib\site-packages (from requests) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\united\anaconda3\lib\site-packages (from requests) (2.3.0)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\united\anaconda3\lib\site-packages (from requests) (2025.11.12)

In [ ]:
!pip install requests